<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [118]:
import pandas as pd
import psycopg2

In [119]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [120]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
query_3_1 = f'''SELECT
COUNT(v.id) count_vacancies   /*выбираем количество элементов из столбца id под алиасом count_vacancies*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/'''

In [6]:
df = pd.read_sql_query(query_3_1,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count_vacancies
0            49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = f'''SELECT
COUNT(e.id) count_employers   /*выбираем количество элементов из столбца id под алиасом count_employers*/
FROM public.employers e   /*из схемы public и таблицы employers, задаём алиас e*/'''

In [8]:
df = pd.read_sql_query(query_3_2,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count_employers
0            23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
query_3_3 = f'''SELECT
COUNT(a.id) count_areas   /*выбираем количество элементов из столбца id под алиасом count_areas*/
FROM public.areas a   /*из схемы public и таблицы areas, задаём алиас a*/ '''

In [10]:
df = pd.read_sql_query(query_3_3,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count_areas
0         1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4 = f'''SELECT
COUNT(i.id) count_industries   /*выбираем количество элементов из столбца id под алиасом count_industries*/
FROM public.industries i   /*из схемы public и таблицы industries, задаём алиас i*/'''

In [12]:
df = pd.read_sql_query(query_3_4,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count_industries
0               294

***

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
query_4_1 = f'''SELECT
COUNT(v.id) cnt,   /*выбираем количество элементов в столбце id таблицы v под алиасом cnt*/
a.name area   /*столбец name таблицы a*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
JOIN public.areas a ON v.area_id = a.id   /*оператор соединения таблиц; таблица areas, алиас a; условие: id таблицы a равен area_id таблицы v*/
GROUP BY 2   /*группировка по name таблицы a*/
ORDER BY 1 DESC   /*сортировка по количеству элементов столбца id таблицы v по убыванию*/
'''

In [14]:
df = pd.read_sql_query(query_4_1,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

      cnt             area
0    5333           Москва
1    2851  Санкт-Петербург
2    2112            Минск
3    2006      Новосибирск
4    1892           Алматы
..    ...              ...
764     1       Тарко-Сале
765     1    Новоаннинский
766     1            Бирск
767     1           Сасово
768     1             Анна

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [15]:
query_4_2 = f'''SELECT
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE (v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL)   /*условие: столбец salary_from таблицы v имеет значение или
                                                               столбец salary_to таблицы v имеет значение*/'''

In [16]:
df = pd.read_sql_query(query_4_2,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [17]:
query_4_3 = f'''SELECT
ROUND(AVG(v.salary_from), 0) mean_salary_from,   /*выбираем округлённое среднее значение в столбце salary_from под алиасом mean_salary_from*/
ROUND(AVG(v.salary_to), 0) mean_salary_to   /*выбираем округлённое среднее значение в столбце salary_to под алиасом mean_salary_to*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/'''

In [18]:
df = pd.read_sql_query(query_4_3,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   mean_salary_from  mean_salary_to
0           71065.0        110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [19]:
query_4_4 = f'''SELECT
COUNT(v.id),   /*выбираем количество элементов в столбце id таблицы v*/
v.schedule,   /*выбираем столбец schedule таблицы v*/
v.employment   /*выбираем столбец employment таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
GROUP BY 2,3   /*группировка по schedule и employment таблицы v*/
ORDER BY 1 DESC   /*сортировка по количеству элементов столбца id таблицы v по убыванию*/'''

In [20]:
df = pd.read_sql_query(query_4_4,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

    count          schedule           employment
0   35367       Полный день     Полная занятость
1    7802  Удаленная работа     Полная занятость
2    1593     Гибкий график     Полная занятость
3    1312  Удаленная работа  Частичная занятость
4     940    Сменный график     Полная занятость
5     569       Полный день           Стажировка
6     367    Вахтовый метод     Полная занятость
7     347       Полный день  Частичная занятость
8     312     Гибкий график  Частичная занятость
9     141       Полный день     Проектная работа
10    133  Удаленная работа     Проектная работа
11    116     Гибкий график           Стажировка
12    101    Сменный график  Частичная занятость
13     64  Удаленная работа           Стажировка
14     18     Гибкий график     Проектная работа
15     12    Сменный график           Стажировка
16      2    Вахтовый метод     Проектная работа
17      1    Сменный график     Проектная работа

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [21]:
query_4_5 = f'''SELECT
COUNT(v.id),   /*выбираем количество элементов в столбце id таблицы v*/
v.experience   /*столбец experience таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
GROUP BY 2   /*группировка по experience таблицы v*/
ORDER BY 1   /*сортировка по количеству элементов столбца id таблицы v по возрастанию*/'''

In [22]:
df = pd.read_sql_query(query_4_5,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

In [23]:
# выводы по детальному анализу вакансий

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [62]:
query_5_1 = f'''(SELECT
COUNT(v.id),   /*выбираем количество элементов в столбце id таблицы v*/
e.name   /*выбираем столбец name таблицы e*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
JOIN public.employers e ON v.employer_id = e.id   /*оператор соединения таблиц; таблица employers, алиас e; условие: employer_id таблицы v равен id таблицы e*/
GROUP BY 2   /*группировка по name таблицы e*/
ORDER BY 1 DESC   /*сортировка по количеству элементов столбца id таблицы v по возрастанию*/
LIMIT 1)   /*выводим только первое значение*/
UNION ALL   /*оператор присоединения*/
(SELECT
COUNT(v.id),   /*выбираем количество элементов в столбце id таблицы v*/
e.name   /*выбираем столбец name таблицы e*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
JOIN public.employers e ON v.employer_id = e.id   /*оператор соединения таблиц; таблица employers, алиас e; условие: employer_id таблицы v равен id таблицы e*/
GROUP BY 2   /*группировка по name таблицы e*/
ORDER BY 1 DESC   /*сортировка по количеству элементов столбца id таблицы v по убыванию*/
OFFSET 4 LIMIT 1)   /*пропускаем первые 4 значения, выводим пятое*/
'''

In [63]:
df = pd.read_sql_query(query_5_1,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count           name
0   1933         Яндекс
1    331  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [70]:
query_5_2 = f'''SELECT
a.name,   /*выбираем столбец name таблицы a*/
COUNT(DISTINCT e.id) count_employers,   /*выбираем количество уникальных элементов в столбце id таблицы e, алиас count_employers*/
COUNT(DISTINCT v.id) count_vacancies   /*выбираем количество уникальных элементов в столбце id таблицы v, алиас count_vacancies*/
FROM public.areas a   /*из схемы public и таблицы areas, задаём алиас a*/
LEFT JOIN public.employers e ON a.id = e.area   /*оператор соединения таблиц; таблица employers, алиас e; условие: id таблицы a равен area таблицы e*/
LEFT JOIN public.vacancies v ON a.id = v.area_id   /*оператор соединения таблиц; таблица employers, алиас e; условие: id таблицы a равен area_id таблицы v*/
WHERE v.name IS NULL   /*условие: столбец name таблицы v  не имеет значения*/
GROUP BY 1   /*группировка по name таблицы a*/
ORDER BY 2 DESC   /*сортировка по количеству элементов столбца id таблицы e по убыванию*/'''

In [71]:
df = pd.read_sql_query(query_5_2,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                               name  count_employers  count_vacancies
0                            Россия              410                0
1                         Казахстан              207                0
2                Московская область               75                0
3                Краснодарский край               19                0
4                          Беларусь               18                0
..                              ...              ...              ...
588                        Кувандык                0                0
589                        Куйбышев                0                0
590  Куйбышево (Ростовская область)                0                0
591                        Култаево                0                0
592                        Кульсары                0                0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [72]:
query_5_3 = f'''SELECT
v.employer_id,   /*выбираем столбец employer_id таблицы v*/
COUNT(DISTINCT a.id) count_areas   /*выбираем количество уникальных элементов в столбце id таблицы a, алиас count_areas*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
JOIN public.areas a ON a.id = v.area_id   /*оператор соединения таблиц; таблица areas, алиас a; условие: id таблицы a равен area_id таблицы v*/
GROUP BY 1   /*группировка по employer_id таблицы v*/
ORDER BY 2 DESC   /*сортировка по количеству элементов столбца id таблицы a по убыванию*/'''

In [73]:
df = pd.read_sql_query(query_5_3,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       employer_id  count_areas
0             1740          181
1             2748          152
2          5724811          116
3          5130287           88
4          3682876           71
...            ...          ...
14901       810278            1
14902       810313            1
14903       810551            1
14904       810688            1
14905       811902            1

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [74]:
query_5_4 = f'''SELECT
COUNT(e.id)   /*выбираем количество элементов в столбце id таблицы e*/
FROM public.employers e   /*из схемы public и таблицы employers, задаём алиас e*/
LEFT JOIN public.employers_industries ei on e.id = ei.employer_id   /*оператор соединения таблиц; таблица employers_industries, алиас ei; условие: id таблицы e равен employer_id таблицы ei*/
WHERE ei.industry_id IS NULL   /*условие: столбец industry_id таблицы ei не имеет значения*/'''

In [75]:
df = pd.read_sql_query(query_5_4,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [76]:
query_5_5 = f'''SELECT
e.name   /*выбираем столбец name таблицы e*/
FROM public.employers e   /*из схемы public и таблицы employers, задаём алиас e*/
JOIN public.employers_industries ei ON e.id = ei.employer_id   /*оператор соединения таблиц; таблица employers_industries, алиас ei; условие: id таблицы e равен employer_id таблицы ei*/
GROUP BY 1   /*группировка по name таблицы e*/
HAVING COUNT(ei.industry_id) = 4   /*условие: количество значений столбца industry_id таблицы ei = 4*/
ORDER BY 1   /*сортировка по столбцу name таблицы e */
OFFSET 2 LIMIT 1   /*пропускаем первые 2 значения, выводим третье*/'''

In [77]:
df = pd.read_sql_query(query_5_5,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [83]:
query_5_6 = f'''SELECT
i.name,   /*выбираем столбец name таблицы i*/
count(e.id)   /*выбираем количество элементов в столбце id таблицы e*/
FROM public.employers e   /*из схемы public и таблицы employers, задаём алиас e*/
JOIN public.employers_industries ei ON e.id = ei.employer_id   /*оператор соединения таблиц; таблица employers_industries, алиас ei; условие: id таблицы e равен employer_id таблицы ei*/
JOIN public.industries i ON i.id = ei.industry_id   /*оператор соединения таблиц; таблица industries, алиас i; условие: id таблицы i равен industry_id таблицы ei*/
WHERE i.name = 'Разработка программного обеспечения'   /*условие:значение столбца name таблицы i = 'Разработка программного обеспечения'*/
GROUP BY 1   /*группировка по name таблицы i*/'''

In [84]:
df = pd.read_sql_query(query_5_6,connection)
df

                                  name  count
0  Разработка программного обеспечения   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [36]:
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response = pd.read_html(url)
million_df = response[1]
million_list = str(tuple(million_df['Город']))

In [92]:
query_5_7 = f'''SELECT
a.name,   /*выбираем столбец name таблицы a*/
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/ 
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
JOIN public.employers e ON e.id = v.employer_id AND e.name = 'Яндекс'   /*оператор соединения таблиц; таблица employers, алиас e; условие: id таблицы e равен employer_id таблицы v и значение name таблицы employers = 'Яндекс'*/
JOIN public.areas a ON a.id = v.area_id AND (a.name IN {million_list} OR a.name LIKE '%Воронеж%')   /*оператор соединения таблиц; таблица areas, алиас a; условие: id таблицы a равен area_id таблицы v и входит в список городов миллионников*/
GROUP BY 1   /*группировка по name таблицы a*/
UNION ALL   /*оператор присоединения*/
SELECT
'Total',   /*создаём признак 'Total'*/
COUNT(v1.id)   /*выбираем количество элементов в столбце id таблицы v1*/
FROM public.vacancies v1   /*из схемы public и таблицы vacancies, задаём алиас v1*/
JOIN public.employers e1 ON e1.id = v1.employer_id AND e1.name = 'Яндекс'   /*оператор соединения таблиц; таблица employers, алиас e1; условие: id таблицы e1 равен employer_id таблицы v1 и значение name таблицы employers = 'Яндекс'*/
JOIN public.areas a1 ON a1.id = v1.area_id AND (a1.name IN {million_list} OR a1.name LIKE '%Воронеж%')   /*оператор соединения таблиц; таблица areas, алиас a1; условие: id таблицы a1 равен area_id таблицы v1 и входит в список городов миллионников*/
ORDER BY 2   /*сортировка по количеству элементов в столбце id таблицы v*/'''

In [93]:
df = pd.read_sql_query(query_5_7,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

               name  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            Total    485

***

In [39]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [94]:
query_6_1 = f'''SELECT
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE LOWER(v.name) LIKE '%data%' OR LOWER(v.name) LiKE '%данн%'   /*условие:значение столбца name таблицы v содержит в себе 'data' или 'данн'*/'''

In [95]:
df = pd.read_sql_query(query_6_1,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [99]:
query_6_2 = f'''SELECT
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE (LOWER(v.name) LIKE '%junior%'   /*условие:значение столбца name таблицы v содержит в себе 'junior'*/
OR v.experience = 'Нет опыта'   /*или значение столбца experience таблицы v содержит 'Нет опыта'*/
OR v.employment = 'Стажировка')   /*или значение столбца employment таблицы v содержит 'Стажировка'*/
AND (LOWER(v.name) LIKE '%data scientist%'   /*и значение столбца name таблицы v содержит 'data scientist'*/
OR LOWER(v.name) LIKE '%data science%'   /*или значение столбца name таблицы v содержит 'data science'*/
OR LOWER(v.name) LIKE '%исследователь данных%'   /*или значение столбца name таблицы v содержит 'исследователь данных'*/
OR LOWER(v.name) LIKE '%machine learning%'   /*или значение столбца name таблицы v содержит 'machine learning'*/
OR LOWER(v.name) LIKE '%машинн%обучен%'   /*или значение столбца name таблицы v содержит 'машинн%обучен'*/
OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))   /*или значение столбца name таблицы v содержит 'ML', но не содержит 'HTML'*/'''

In [100]:
df = pd.read_sql_query(query_6_2,connection)
df

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [101]:
query_6_3 = f'''SELECT
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE (v.key_skills LIKE '%SQL%'   /*условие:значение столбца key_skills таблицы v содержит в себе 'SQL'*/
OR LOWER (v.key_skills) LIKE '%postgres%')   /*или значение столбца key_skills таблицы v содержит в себе 'postgres'*/
AND (LOWER(v.name) LIKE '%data scientist%'   /*и значение столбца name таблицы v содержит 'data scientist'*/
OR LOWER(v.name) LIKE '%data science%'   /*или значение столбца name таблицы v содержит 'data science'*/
OR LOWER(v.name) LIKE '%исследователь данных%'   /*или значение столбца name таблицы v содержит 'исследователь данных'*/
OR LOWER(v.name) LIKE '%machine learning%'   /*или значение столбца name таблицы v содержит 'machine learning'*/
OR LOWER(v.name) LIKE '%машинн%обучен%'   /*или значение столбца name таблицы v содержит 'машинн%обучен'*/
OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))   /*или значение столбца name таблицы v содержит 'ML', но не содержит 'HTML'*/'''

In [102]:
df = pd.read_sql_query(query_6_3,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [107]:
query_6_4 = f'''SELECT
COUNT(v.id)   /*выбираем количество элементов в столбце id таблицы v*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE (v.key_skills LIKE '%Python%')   /*условие:значение столбца key_skills таблицы v содержит в себе 'Python'*/
AND (LOWER(v.name) LIKE '%data scientist%'   /*и значение столбца name таблицы v содержит 'data scientist'*/
OR LOWER(v.name) LIKE '%data science%'   /*или значение столбца name таблицы v содержит 'data science'*/
OR LOWER(v.name) LIKE '%исследователь данных%'   /*или значение столбца name таблицы v содержит 'исследователь данных'*/
OR LOWER(v.name) LIKE '%machine learning%'   /*или значение столбца name таблицы v содержит 'machine learning'*/
OR LOWER(v.name) LIKE '%машинн%обучен%'   /*или значение столбца name таблицы v содержит 'машинн%обучен'*/
OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))   /*или значение столбца name таблицы v содержит 'ML', но не содержит 'HTML'*/'''

In [108]:
df = pd.read_sql_query(query_6_4,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [116]:
query_6_5 = f'''SELECT
ROUND(AVG(LENGTH(v.key_skills)-LENGTH(REPLACE(v.key_skills,CHR(9),''))+1), 2) round_avg   /*выбираем округлённое значение среднего количества ключевых навыков, алиас round_avg*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE(LOWER(v.name) LIKE '%data scientist%'   /*условие:значение столбца name таблицы v содержит 'data scientist'*/
OR LOWER(v.name) LIKE '%data science%'   /*или значение столбца name таблицы v содержит 'data science'*/
OR LOWER(v.name) LIKE '%исследователь данных%'   /*или значение столбца name таблицы v содержит 'исследователь данных'*/
OR LOWER(v.name) LIKE '%machine learning%'   /*или значение столбца name таблицы v содержит 'machine learning'*/
OR LOWER(v.name) LIKE '%машинн%обучен%'   /*или значение столбца name таблицы v содержит 'машинн%обучен'*/
OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))   /*или значение столбца name таблицы v содержит 'ML', но не содержит 'HTML'*/'''

In [117]:
df = pd.read_sql_query(query_6_5,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   round_avg
0       6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [121]:
query_6_6 = f'''SELECT
DISTINCT(v.experience) experience,  /*выбираем уникальные значения элементов в столбце experience таблицы v, алиас experience*/
ROUND(AVG(coalesce((salary_from + salary_to) / 2, salary_from, salary_to)), 0) salary   /*выбираем округлённое значение средней зарплаты, алиас salary*/
FROM public.vacancies v   /*из схемы public и таблицы vacancies, задаём алиас v*/
WHERE(LOWER(v.name) LIKE '%data scientist%'   /*условие:значение столбца name таблицы v содержит 'data scientist'*/
OR LOWER(v.name) LIKE '%data science%'   /*или значение столбца name таблицы v содержит 'data science'*/
OR LOWER(v.name) LIKE '%исследователь данных%'   /*или значение столбца name таблицы v содержит 'исследователь данных'*/
OR LOWER(v.name) LIKE '%machine learning%'   /*или значение столбца name таблицы v содержит 'machine learning'*/
OR LOWER(v.name) LIKE '%машинн%обучен%'   /*или значение столбца name таблицы v содержит 'машинн%обучен'*/
OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))   /*или значение столбца name таблицы v содержит 'ML', но не содержит 'HTML'*/
AND (v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL)
GROUP BY 1'''

In [122]:
df = pd.read_sql_query(query_6_6,connection)
df

c:\Users\oteck\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience    salary
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

In [52]:
# выводы по предметному анализу

# Общий вывод по проекту

In [53]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

In [54]:
connection.close()